pub fn fir_half_band_coeffs() -> Vec<i16> {
    // vec![
    //     1023, 649, 0, -212, 0, 122, 0, -82, 0, 59, 0, -43, 0, 32, 0, -24, 0, 18, 0, -13, 0, 9, 0,
    //     -6, 0, 4, 0, -2, 0, 2, 0, -1,
    // ]

    //./design_fir.py 23 hamming
    // vec![
    //     1023,639,0,-182,0,78,0,-32,0,11,0,-4
    // ]

    //./design_fir.py 25 hann
    vec![
        //1023,640,0,-185,0,81,0,-34,0,10,0,-1
        //1023,645,0,-200,0,104,0,-59,0,32,0,-16,0,6,0,-1
        16383, 10376, 0, -3319, 0, 1831, 0, -1147, 0, 742, 0, -474, 0, 288, 0, -159, 0, 74, 0, -24,
        0, 2, 0, // ./design_fir.py 45 hann
    ]
}

pub fn fir_anti_aliasing_coeffs() -> Vec<i16> {
    // ./design_fir.py 64 hamming
    vec![
        //4096, -828, 0, 322, -375, 277, -128, 0, 70, -82, 58, -25, 0, 11, -13, 11,
        4096, -559, -327, 544, -403, 128, 101, -192, 153, -50, -39, 73, -56, 18, 13, -23, 16, -5,
        -4, 8,
    ]
}

pub fn calculate_safe_shift(coeffs: &[i16]) -> u32 {
    // 1. 计算所有系数绝对值的总和 (L1 Norm)
    // 使用 i64 以防系数非常多导致 i32 溢出
    let sum_abs: i64 = coeffs.iter().map(|&c| c.abs() as i64).sum();

    // 2. 假设输入信号是满量程的 i16 (最大绝对值为 32768)
    // 理论最大累加值 = 32768 * sum_abs
    // 我们需要将这个值缩回到 15-bit (32768) 范围内。
    // 即： (32768 * sum_abs) >> bit_shift <= 32768
    // 简化后： sum_abs <= 2^bit_shift

    // 3. 计算需要的最小位移量： log2(sum_abs) 向上取整
    let safe_shift = if sum_abs <= 1 {
        0
    } else {
        // 使用 f64 计算对数并向上取整
        (sum_abs as f64).log2().ceil() as u32
    };

    println!("滤波器系数绝对值之和: {}", sum_abs);
    println!("为保证绝对不溢出，建议 bit_shift 为: {}", safe_shift);

    safe_shift
}

pub fn fir_coeffs_f32() -> Vec<f32> {
    // vec![
    //     1023, 649, 0, -212, 0, 122, 0, -82, 0, 59, 0, -43, 0, 32, 0, -24, 0, 18, 0, -13, 0, 9, 0,
    //     -6, 0, 4, 0, -2, 0, 2, 0, -1,
    // ]

    //./design_fir.py 23 hamming
    // vec![
    //     1023,639,0,-182,0,78,0,-32,0,11,0,-4
    // ]

    //./design_fir.py 25 hann
    vec![
        //1023,640,0,-185,0,81,0,-34,0,10,0,-1
        //1023,645,0,-200,0,104,0,-59,0,32,0,-16,0,6,0,-1
        1023.0, 647.0, 0., -205., 0., 111., 0., -67., 0., 41., 0., -24., 0., 13., 0., -6., 0., 2.,
    ]
}
